In [1]:
pip install pandas

Requirement already satisfied: pandas in c:\users\user\appdata\local\programs\python\python311\lib\site-packages (2.2.2)
Requirement already satisfied: numpy>=1.23.2 in c:\users\user\appdata\local\programs\python\python311\lib\site-packages (from pandas) (1.26.0)
Requirement already satisfied: python-dateutil>=2.8.2 in c:\users\user\appdata\local\programs\python\python311\lib\site-packages (from pandas) (2.9.0.post0)
Requirement already satisfied: pytz>=2020.1 in c:\users\user\appdata\local\programs\python\python311\lib\site-packages (from pandas) (2023.3.post1)
Requirement already satisfied: tzdata>=2022.7 in c:\users\user\appdata\local\programs\python\python311\lib\site-packages (from pandas) (2023.3)
Requirement already satisfied: six>=1.5 in c:\users\user\appdata\local\programs\python\python311\lib\site-packages (from python-dateutil>=2.8.2->pandas) (1.16.0)
Note: you may need to restart the kernel to use updated packages.

[notice] A new release of pip is available: 23.3.1 -> 24.1.2
[notice] To update, run: python.exe -m pip install --upgrade pip

In [6]:
import pandas as pd

In [4]:
data=[1,2,3,4,5,6,7]

In [5]:
type(data)

list

In [9]:
s = pd.Series(data)
s

0    1
1    2
2    3
3    4
4    5
5    6
6    7
dtype: int64

In [18]:
df=pd.DataFrame(s,columns=["number"])
df

   number
0       1
1       2
2       3
3       4
4       5
5       6
6       7

In [19]:
#list to dataFrame
data

[1, 2, 3, 4, 5, 6, 7]

In [21]:
df1=pd.DataFrame(data,columns=["nums"])
df1

   nums
0     1
1     2
2     3
3     4
4     5
5     6
6     7

In [22]:
s2=df1["nums"]
s2

0    1
1    2
2    3
3    4
4    5
5    6
6    7
Name: nums, dtype: int64

In [23]:
type(s2)

pandas.core.series.Series

In [25]:
data1=[[1,2],[3,4],[5,6]]
data1

[[1, 2], [3, 4], [5, 6]]

In [26]:
ss=pd.Series(data1)
ss

0    [1, 2]
1    [3, 4]
2    [5, 6]
dtype: object

In [28]:
dff=pd.DataFrame(data1,columns=["num1","num2"])
dff

   num1  num2
0     1     2
1     3     4
2     5     6

In [30]:
sss=dff[["num1","num2"]]
sss

   num1  num2
0     1     2
1     3     4
2     5     6

In [31]:
type(sss)

pandas.core.frame.DataFrame

In [33]:
data ={
    'name':['Omuk', 'Tomuk', 'Chomuk'],
    'age':[10,20,30],
    'city':['patiya','chandanish','noakhali']
}
data

{'name': ['Omuk', 'Tomuk', 'Chomuk'],
 'age': [10, 20, 30],
 'city': ['patiya', 'chandanish', 'noakhali']}

In [43]:
s=pd.Series(data['age'])
s

0    10
1    20
2    30
dtype: int64

In [40]:
df=pd.DataFrame(data)
df

     name  age        city
0    Omuk   10      patiya
1   Tomuk   20  chandanish
2  Chomuk   30    noakhali

In [44]:
ageseries=df['age']
ageseries

0    10
1    20
2    30
Name: age, dtype: int64

In [45]:
type(ageseries)

pandas.core.series.Series